# 1  获取工资额
shui = 0
salary = int(input("输入工资额："))
# ２　判断级别，并应用相应的计算公式
if salary<=1500:
    shui = salary*0.03
    # print("需要缴税额为：％ｄ" % shui)
elif 1500<salary<4500:
    shui = (salary-1500)*0.10+1500*0.03
    # print("需要缴税额为：％ｄ" % shui)
elif 4500<salary<9000:
    shui = (salary-4500)*0.20+1500*0.03+3000*0.10
    print("需要缴税额为：％ｄ" % shui)
elif 9000<salary<35000:
    shui = (salary-9000)*0.25+1500*0.03+3000*0.10+4500*0.20
    # print("需要缴税额为：％ｄ" % shui)
elif 35000<salary<5500:
    shui = (salary-35000)*0.30+1500*0.03+3000*0.10+4500*0.20+26000*0.25
    # print("需要缴税额为：％ｄ" % shui)
elif 55000<salary<80000:
    shui = (salary-55000)*0.35+1500*0.03+3000*0.10+4500*0.20+26000*0.25+20000*0.30
    # print("需要缴税额为：％ｄ" % shui)
else:
    shui= (salary-80000)*0.45+3000*0.10+4500*0.20+26000*0.25+20000*0.30+25000*0.35

print("需要缴纳税收额为：%d" % shui)
